# не може бути порожнім ? а навіщо перевіряти пустий пароль? просто геть та й усе
# не менше 8 символів !!!сорян, мені лінь буде потім щоразу на тестах вводити по 16 символів))
# хоча б одну цифру
# хоча б одну велику літеру
# маленьку літеру
# хоча б один спеціальний символ (₴#&_-@)


password = input(f"Будь ласка, введіть пароль що складається мінімум з 8 символів, містить мінімум одну маленьку, велику літеру, цифру та спеціальний символ (₴#&_-@) : \n")

lengthCheck = len(password)
if not lengthCheck:
    print("Ви не ввели пароль. Перезапустіть програму.")
    exit()
if lengthCheck < 8:
    print ("Пароль містить менше 8 символів.")
